Дневник_Инвестора/src/InformationRegisters/ОчередьОбработкиЭмитентаАктива/ОчередьОбработкиЭмитентаАктива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбработкиЭмитентаАктива</name>
  <resources>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиОчередей</types>
    </type>
  </resources>
  <dimensions>
    <name>Актив</name>
    <type>
      <types>DefinedType.Актив</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЭмитента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дневник_Инвестора/src/Catalogs/Облигации/Облигации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Облигации</name>
  <attributes>
    <name>Тикер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ISIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Эмитент</name>
    <type>
      <types>CatalogRef.Эмитенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАктива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Дневник_Инвестора/src/CommonModules/ИнтеграционныйМодульТБанк/Module.bsl
#Область ПрограммныйИнтерфейс

// Настройки интеграции Т-Банк.
// 
// Возвращаемое значение:
//  Структура - Настройки интеграции Т-Банк:
// * АдресПодключения - Строка
// * ТокенДоступа - Строка 
// * ИспользоватьИнтеграциюТБанк - Булево
//
Функция НастройкиИнтеграцииТБанк() Экспорт
	
	ПараметрыИнтеграции = НовыйПараметрыИнтеграцииТБанк();
	ТекущиеПараметры = Константы.НастройкиИнтеграцииТБанк.Получить().Получить(); 
	
	Если ЗначениеЗаполнено(ТекущиеПараметры) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции, ТекущиеПараметры);
		ПараметрыИнтеграции.ИспользоватьИнтеграциюТБанк = Константы.ИспользоватьИнтеграциюТБанк.Получить();
	КонецЕсли;	
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

// Сохранить настройки.
// 
// Параметры:
//  НастройкиИнтеграции - Структура - Настройки интеграции Т-Банк:
// 	* АдресПодключения - Строка
// 	* ТокенДоступа - Строка 
// 	* ИспользоватьИнтеграциюТБанк - Булево
//
Процедура СохранитьНастройки(НастройкиИнтеграции) Экспорт
	
	Константы.НастройкиИнтеграцииТБанк.Установить(Новый ХранилищеЗначения(НастройкиИнтеграции));
	Константы.ИспользоватьИнтеграциюТБанк.Установить(НастройкиИнтеграции.ИспользоватьИнтеграциюТБанк);
	
КонецПроцедуры

// Обновить нормативно справочную информацию.
//
Процедура ОбновитьНормативноСправочнуюИнформацию() Экспорт
	
	НастройкиИнтеграции = НастройкиИнтеграцииТБанк();
	
	Если Не НастройкиИнтеграции.ИспользоватьИнтеграциюТБанк Тогда
		ОбщегоНазначения.СообщитьПользователю("Настройки интеграции с Т-Банк не установлены. Обновить НСИ невозможно.");
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокВалют();
	ОбновитьСписокЭмитентов(НастройкиИнтеграции);
	ОбновитьСписокОблигацийТоргуемыхНаБирже(НастройкиИнтеграции);
	СопоставитьЭмитентовИОблигацииВыпускаемые(НастройкиИнтеграции);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйПараметрыИнтеграцииТБанк() Экспорт
	
	ПараметрыИнтеграции = Новый Структура;
	ПараметрыИнтеграции.Вставить("АдресПодключения", "");
	ПараметрыИнтеграции.Вставить("ТокенДоступа", "");
	ПараметрыИнтеграции.Вставить("ИспользоватьИнтеграциюТБанк", Ложь);
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

Процедура ОбновитьСписокОблигацийТоргуемыхНаБирже(НастройкиИнтеграции) Экспорт
	
	ДополнительныеПараметры = ПараметрыПодключенияКТБанку(НастройкиИнтеграции);
		
	СтрокаПодключения = СтрШаблон("%1/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/Bonds",
		НастройкиИнтеграции.АдресПодключения);    
		
	Данные = Новый Структура;
	Данные.Вставить("instrumentStatus", "INSTRUMENT_STATUS_UNSPECIFIED");
	Данные.Вставить("instrumentExchange", "INSTRUMENT_EXCHANGE_UNSPECIFIED");
	
	Ответ = КоннекторHTTP.PostJson(СтрокаПодключения, Данные, ДополнительныеПараметры);
	
	ИнтеграционныйМодульТБанкСлужебный.РазобратьОтветПоСпискуОблигаций(Ответ);
	
КонецПроцедуры

Процедура ОбновитьСписокЭмитентов(НастройкиИнтеграции) Экспорт
	
	ДополнительныеПараметры = ПараметрыПодключенияКТБанку(НастройкиИнтеграции);
		
	СтрокаПодключения = СтрШаблон("%1/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/GetBrands",
		НастройкиИнтеграции.АдресПодключения);    
		
	Данные = Новый Структура;
	Данные.Вставить("paging", НовыйДанныеПагинации());
	
	Ответ = КоннекторHTTP.PostJson(СтрокаПодключения, Данные, ДополнительныеПараметры);
	
	ИнтеграционныйМодульТБанкСлужебный.РазобратьОтветПоСпискуЭмитентов(Ответ);

КонецПроцедуры

Процедура ОбновитьСписокВалют() Экспорт
	
	ДанныеОбновления = Новый Массив;
	ДанныеОбновления.Добавить("840"); // USD
	ДанныеОбновления.Добавить("643"); // RUB
	ДанныеОбновления.Добавить("978"); // EUR
	ДанныеОбновления.Добавить("156"); // CNY
	
	РаботаСКурсамиВалют.ДобавитьВалютыПоКоду(ДанныеОбновления);
	
КонецПроцедуры

Процедура СопоставитьЭмитентовИОблигацииВыпускаемые(НастройкиИнтеграции) Экспорт
	
	ДополнительныеПараметры = ПараметрыПодключенияКТБанку(НастройкиИнтеграции);

	СтрокаПодключения = СтрШаблон("%1/rest/tinkoff.public.invest.api.contract.v1.InstrumentsService/GetAssetBy",
		НастройкиИнтеграции.АдресПодключения);

	ОблигацииСНеопределеннымЭмитентом = Справочники.Облигации.ОблигацииСИдентификаторамиАктивовСНеопределеннымЭмитентом();
	
	Для Каждого Облигация Из ОблигацииСНеопределеннымЭмитентом Цикл
		
		Данные = Новый Структура;
		Данные.Вставить("id", Облигация.ИдентификаторАктива);
		
		Попытка	
			Ответ = КоннекторHTTP.PostJson(СтрокаПодключения, Данные, ДополнительныеПараметры);
		
			ПараметрыЗаписи = РегистрыСведений.ОчередьОбработкиЭмитентаАктива.НовыйПараметрыЗаписи();
			ПараметрыЗаписи.Актив = Облигация.Ссылка;
			ПараметрыЗаписи.ИдентификаторЭмитента = ИдентификаторЭмитентаПоОтвету(Ответ);
		
			РегистрыСведений.ОчередьОбработкиЭмитентаАктива.СоздатьНовуюЗапись(ПараметрыЗаписи);
		Исключение
			// TODO: Реализация исключения		
		КонецПопытки;
						
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыПодключенияКТБанку(НастройкиИнтеграции)
		
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Заголовки.Вставить("Accepts", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1",
		НастройкиИнтеграции.ТокенДоступа));
		
	ДополнительныеПараметры.Таймаут = 60;
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

// Новый данные пагинации.
// 
// Возвращаемое значение:
//  Структура - Новый данные пагинации:
// * limit - Число - Максимальное число возвращаемых записей.
// * pageNumber - Число - Порядковый номер страницы, начиная с 0.
//
Функция НовыйДанныеПагинации()
	
	ДанныеПагинации = Новый Структура;
	ДанныеПагинации.Вставить("limit", 10000);
	ДанныеПагинации.Вставить("pageNumber", 0);
	
	Возврат ДанныеПагинации;
	
КонецФункции

// Идентификатор эмитента по ответу.
// 
// Параметры:
//  Ответ - Соответствие Из КлючИЗначение - Ответ от сервера ТБанка
// 
// Возвращаемое значение:
//  Строка - Идентификатор эмитента по ответу
//
Функция ИдентификаторЭмитентаПоОтвету(Ответ)
	
	Идентификатор = "";
	
	Актив = Ответ["asset"];
	Если Актив <> Неопределено Тогда
		Эмитент = Актив["brand"];
		Если Эмитент <> Неопределено Тогда
			Идентификатор = ?(ЗначениеЗаполнено(Эмитент["uid"]), Эмитент["uid"], "");			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

#КонецОбласти
